#language: ru

  Функционал: Клик на плитку курса

    Сценарий: Клик по плитке раннегокурса на главной странице
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть на раннюю плитку курса
      Тогда откроется страница курса

    Сценарий: Клик по плитке позднего курса на главной странице
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть на позднюю плитку курса
      Тогда откроется страница курса

    Сценарий: Клик по плитке курса на главной странице по названию
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть на плитку курса с названием Специализация iOS Developer
      Тогда откроется страница курса с названием iOS Developer

    Сценарий: Клик по плитке курса на главной странице по названию
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть на плитку курса с названием Специализация Системный аналитик
      Тогда откроется страница курса с названием Системный аналитик

    Сценарий: Клик по плитке курса на главной странице по названию
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть на плитку курса с названием Специализация Android
      Тогда откроется страница курса с названием Android Developer

    Сценарий: Клик на плитку дорого курса
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть по курсу с самой дорогой ценой
      Тогда откроется страница курса

    Сценарий: Клик на плитку дешевого курса
      Пусть Открыть браузер "chrome"
      Если Открыть главную страницу
      Если Кликнуть по курсу с самой дешевой ценой
      Тогда откроется страница курса